Task 1

In [1]:
import pandas as pd

In [22]:
authors = pd.DataFrame()

In [23]:
authors["author_id"]=[1,2,3]
authors["author_name"]=["Тургенев","Чехов","Островский"]

In [24]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [25]:
books = pd.DataFrame()

In [26]:
books["author_id"] = [1,1,1,2,2,3,3]
books["book_title"] = ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники']
books["price"] = [450, 300, 350, 500, 450, 370, 290]

In [27]:
books

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

Task 2

In [38]:
authors_price = pd.merge(authors,books,on ="author_id")

In [39]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

Task 3

In [40]:
top5 = authors_price.sort_values(by = 'price',ascending=[False]).iloc[:5,:]

In [41]:
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

Task 4

In [42]:
authors_stat = authors_price.groupby('author_name').agg({'price':['min', 'max', 'mean']})

In [43]:
authors_stat = authors_stat.rename(columns={'min':'min_price', 'max':'max_price', 'mean':'mean_price'})

In [44]:
authors_stat

                price
            min_price max_price  mean_price
author_name
Островский        290       370  330.000000
Тургенев          300       450  366.666667
Чехов             450       500  475.000000

Task 5

In [45]:
authors_price["cover"] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']

In [46]:
? pd.pivot_table

In [47]:
book_info = pd.pivot_table(authors_price, values = 'price', index='author_name', columns='cover',fill_value=0,aggfunc='sum')

In [48]:
book_info

cover        мягкая  твердая
author_name
Островский      660        0
Тургенев        650      450
Чехов             0      950

In [52]:
book_info.to_pickle('book_info.pkl')

In [53]:
book_info2=pd.read_pickle('book_info.pkl')

In [54]:
book_info2

cover        мягкая  твердая
author_name
Островский      660        0
Тургенев        650      450
Чехов             0      950

In [55]:
book_info == book_info2

cover        мягкая  твердая
author_name
Островский     True     True
Тургенев       True     True
Чехов          True     True